Feature: Управление на публикации

	Background:
    Given Потребителя отваря екрана за управление на публикациите

  Scenario Outline: Успешно създаване на публикация
    When Добавя заглавие: "<title>"
    And Добавя съдържание: "<content>"
    And Натиска бутона публикувай
    Then Вижда съобщение: "<expectedMessage>"
    
   Examples: 
   |title   |content   |expectedMessage     | 
   |Заглавие|Съдържание|Успешна публикация  |
   |        |Съдържание|Успешна публикация  |
   |Заглавие|          |Въведете съдържание!|
   |        |          |Въведете съдържание!|
    
 