Feature: Регистрация на потребител

 
  Scenario Outline: Регистрация на потребител
    Given Потребителя отваря екрана за регистрация на потребител
    When Въвежда потребитесло име: "<Потребителско име>"
    And Въвежда първа парола: "<Първа парола>"
    And Въвежда втора парола: "<Втора парола>"
    And Въвежда електронна поща: "<Email>"
    And Натиска бутона за регистрация
    Then Вижда съобщение: "<Съобщение>"

    Examples: 
      | Потребителско име  | Първа парола | Втора парола  |Email           |Съобщение                    |
      | Pesho              |   Pass123!   | Pass123!      | pesho@abv.bg   |Регистрирахте се успешно!    |
      | Pesho              |   Pas        | Pas           | pesho@abv.bg   |Въведете парола с поне четери знака!    |
      | Pe                 |   Pass123!   | Pass123!      | pesho@abv.bg   |Въведете име с поне три знака!|
      | Pesho1             |   Pass123!   | Pass123!      | pesho1@abv.bg   |Потребителското име е заето! |
      | Pesho2             |   Pass123!   | Pass123!      | pesho2@abv.bg  |Има регистриран потребител с тази поща! |
      | Pesho              |   Pass123!   | Pass123!      |                |Въведете електронна поща!    |
      | Pesho              |   Pass123!   | Pass123!      |   pesho        |Въведете валидна електронна поща!|
      |                    |   Pass123!   | Pass123!      | pesho@abv.bg   |Въведете потребитеско име!   |
      | Pesho              |   Pass123!   | P123!         | pesho@abv.bg   |Въведете еднакви пароли!     |
      | Pesho              |              | P123!         | pesho@abv.bg   |Въведете парола!             |
      | Pesho              |   Pass123!   |               | pesho@abv.bg   |Въведете парола!             |
      | Pesho              |              |               | pesho@abv.bg   |Въведете парола!             |
